Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.Handlers
The Tekla.Structures.DirectManipulation.Adapter.Controls.ContextualToolsPreviewProvider.Handlers class stores the list of functions used to retrieve the controls.